Revit 2024 API
ExternalServices.BuiltInExternalServices.RebarUpdateService Property
 Autodesk Internal: The service for updating rebar freeform elements
Namespace: Autodesk.Revit.DB.ExternalService
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static ExternalServiceId RebarUpdateService { get; }
Visual Basic
Public Shared ReadOnly Property RebarUpdateService As ExternalServiceId
	Get
Visual C++
public:
static property ExternalServiceId^ RebarUpdateService {
	ExternalServiceId^ get ();
}
See Also
ExternalServices.BuiltInExternalServices Class
Autodesk.Revit.DB.ExternalService Namespace